import{f as v,g as D,h as B,i as G,t as b,u as O,j as U,o as g,c as i,k as V,v as F,a as m,n as P,l as A,F as y,m as k,p as W,q as M,s as X}from"./app-f01f6582.js";import{_ as N}from"./plugin-vue_export-helper-c27b6911.js";const _=[{path:"/apkxa.html",title:"如何安装apk版本并进行游戏内购买？",pathLocale:"/",contents:[{header:"如何安装apk版本并进行游戏内购买？",slug:"如何安装apk版本并进行游戏内购买",content:""},{header:"注意，指挥官们！",slug:"注意-指挥官们",content:`由于支付系统的限制，我们来自某些国家/地区的玩家在尝试进行游戏内购买时可能会遇到困难。
为了解决这些问题，我们按照玩家的意愿进行了购买，并增加了在我们的购买功能。网站 提示
另外，我们想通知您，我们已将艾克索拉支付系统集成到游戏的apk客户端中。该解决方案将允许您直接在游戏中进行购买，而无需使用第三方服务。 艾克索拉（Xsolla） 是一项付款接受服务。其合作伙伴是全球 2,000 多名开发人员。该公司支持700种不同货币的130多种支付方式，并以200种语言在20多个国家提供服务。`},{header:"一、如何在现代战舰官方网站上进行购买？",slug:"一、如何在现代战舰官方网站上进行购买",content:`点击链接 - artstorm.com 点击“登录”。 输入您的 Artstorm 帐户详细信息（电子邮件 + 密码）。请注意，您只能使用登录游戏的帐户进行购买。 登录后，您将被重定向到商店页面。选择您要购买的拍品。然后点击“为我购买”按钮。 此时，您将被重定向到艾克索拉支付服务网站。选择通过银行卡或任何其他方便的方式为您的帐户充值，然后按照屏幕上的说明进行操作。 祝贺！ 您已成功完成购买。游戏价值已记入您的现代战舰帐户！
要查看您的购买历史记录，请转到具有相应名称的网站部分。`},{header:"二、如何安装apk版本并在游戏中进行购买？",slug:"二、如何安装apk版本并在游戏中进行购买",content:`注意
请注意，此方法最方便。Apk 版本与原始版本没有区别，允许您直接在游戏客户端内进行购买。 确保您的游戏帐户与您的 Artstorm 帐户相关联（电子邮件地址 + 密码）。为此，请转到“设置”->“帐户”。 如果您在此页面上看到您的电子邮件地址，则您的帐户已关联，您可以稍后使用它登录。 账户已关联 如果帐户未链接到电子邮件地址，请单击“添加”，然后按照说明确认您的电子邮件。 账户未关联 小贴士
您可以使用任何授权方法，包括Facebook，Google Play和华为。但我们建议使用 Artstorm 帐户（电子邮件地址），因为它是目前最可靠的。其他身份验证方法可能会导致没有 Google 服务的手机出现问题。 转到我们的网站通过向下滚动页面找到并单击“下载APK”。这将开始下载游戏文件。 等待文件下载（最好使用Wi-Fi），然后开始安装下载的APK文件。如有必要，请在电话设置中接受从此源安装应用程序的权限。 通过选择与您的帐户关联的方法之一登录。 “电子邮件” = Artstorm 帐户 恭喜！最新的现代战舰apk版本已安装在您的设备上。现在，您可以直接在游戏中进行购买，并享受官方游戏客户端的其他好处。`}]},{path:"/BP.html",title:"通行证",pathLocale:"/",contents:[{header:"通行证",slug:"通行证",content:""},{header:"什么是战斗通行证？它有什么用？",slug:"什么是战斗通行证-它有什么用",content:`战斗通行证让您有机会获得新赛季的独特奖励。
战斗通行证包括三个类型，有40个进度阶段。
战斗通行证有效期至赛季（月）结束。`},{header:"战斗通行证的等级是什么？",slug:"战斗通行证的等级是什么",content:`标准战斗通行证（绿色奖励） - 适用于所有玩家
高级战斗通行证（蓝色奖励） - 购买高级BP后可获得
VIP战斗通行证（紫色奖励） - 购买VIP BP后可用`},{header:"如何在战斗通行证中获得奖励？",slug:"如何在战斗通行证中获得奖励",content:"要增加战斗通行证阶段，您必须获得战斗积分。"},{header:"如何获得战斗积分？",slug:"如何获得战斗积分",content:`完成每日任务可获得战斗通行证积分作为奖励。
每天进入游戏可以获得一些BP积分作为奖励。
您可以通过支付金币，点击BP菜单中相应阶段上方的数字，通过BP阶段。 小贴士
您可以通过单击战斗通行证进度条在游戏中获得 40 个战斗点数。一个阶段（40 BP点）花费750金币。`},{header:"战斗通行证的最高进度是多少？",slug:"战斗通行证的最高进度是多少",content:"战斗通行证包括 40 个等级。"},{header:"重置战斗通行证。",slug:"重置战斗通行证。",content:"通过BP并获得奖励后，您可以重置BP。 重置战斗通行证将允许您多次获得奖励。但是，重置后，如果您打算获得蓝色或紫色奖励，则必须再次购买BP。"},{header:"战斗通行证可以重置多少次？",slug:"战斗通行证可以重置多少次",content:"每个赛季可以重置6次战斗通行证的进度。每次重置花费 5，000 金币。"},{header:"是否可以从高级战令升级到VIP战令？",slug:"是否可以从高级战令升级到vip战令",content:"是的，这是可能的。要购买VIP通行证，您必须支付VIP通行证的全价。"},{header:"端口错误显示战斗通行证时间，战斗通行证损坏。",slug:"端口错误显示战斗通行证时间-战斗通行证损坏。",content:"您需要更新游戏客户端。"},{header:"我购买了战斗通行证，但购买没有记入。",slug:"我购买了战斗通行证-但购买没有记入。",content:"如果您在 24 小时内未收到购买的商品 - 联系支持人员。提供游戏帐户的ID并附上购买收据，它在您的邮件中（需要商店提供的交易编号）"},{header:"BP多久更新一次？",slug:"bp多久更新一次",content:"战斗通行证赛季持续一个月。每个月都会发布更新，一些新的游戏内容肯定会包含在战斗通行证中。"}]},{path:"/BS.html",title:"比赛",pathLocale:"/",contents:[{header:"比赛",slug:"比赛",content:`声明
在锦标赛中获得英雄和传奇状态暂时禁用。您可以在社区锦标赛中赢得英雄和传奇身份。`},{header:"如何参加锦标赛？",slug:"如何参加锦标赛",content:"每个玩家都会自动进入锦标赛。主要条件 - 所有锦标赛结果仅在与其他玩家在线玩游戏时才计算在内。“离线”和“自定义游戏”的结果不被考虑在内。"},{header:"如何赢得比赛？",slug:"如何赢得比赛",content:""},{header:"锦标赛有两种类型，一种基于“击杀”，一种基于“伤害”。锦标赛也分为两个阶段：",content:`获得“英雄”身份
获得“传奇”身份。`},{header:"要赢得“英雄”锦标赛，您必须完成以下步骤之一：",content:`在一定时间内在所有玩家中造成最大的伤害。
在特定时间段内杀死最多的玩家。 小贴士 锦标赛“英雄”每 24 小时举行一次（截止日期可能会发生变化），比赛每天凌晨 3：00 以 UTC 开始。
要赢得锦标赛“传奇”，您必须在一个月内赢得所有玩家中最多的“英雄”锦标赛（时间可能会改变）`},{header:"锦标赛的获胜者可以使用什么，英雄和传奇有什么区别？",slug:"锦标赛的获胜者可以使用什么-英雄和传奇有什么区别",content:"“传奇”和“英雄”在地位上有所不同。状态显示在玩家统计数据和昵称上方以及战斗中。“英雄”可以使用独特的涂装和装备。“传奇”可以访问“英雄”拥有的一切，也可以访问秘密船只。"}]},{path:"/cn.html",title:"国区各赛事针对脚本号参赛行为处理规范",pathLocale:"/",contents:[{header:"国区各赛事针对脚本号参赛行为处理规范",slug:"国区各赛事针对脚本号参赛行为处理规范",content:"应开发者要求，即日起国区全部官方支持赛事开始严打脚本号参赛行为，细则如下： 各赛事办赛方工作人员应严格执行报名ID检查制度，对即日起每届比赛全部报名ID进行逐一搜索并截图数据页留档，如发现疑似数据异常账号应及时报告国区管理APEX/凯撒/北望，以上报开发者进行后台查证。 办赛期间由开发者后台查实的脚本号，除该账号会按照相关惩处规定进行包括但不限于永久或暂时封禁、扣除经验等级等处罚外，该账号还将会列入国区赛事永久禁赛名单。 除对脚本号本身的处理之外，脚本号所在队伍将会受到以下惩罚：不论比赛进度如何，所在队伍全队立即取消成绩并强制退赛；脚本号所在队伍其他全部参赛成员列入国区赛事禁赛名单两个月。 如正常账号多次与脚本账号组队参赛，禁赛处罚将会逐次加重。第一次：禁赛两个月；第二次：禁赛半年；第三次：永久禁赛。 视情节严重程度，上述涉事账号或将同步至国际区赛事禁赛名单。"}]},{path:"/ct.html",title:"国区赛事收录",pathLocale:"/",contents:[{header:"国区赛事收录",slug:"国区赛事收录",content:`提示
收录暂未获得授权，随时会变动 MWLC
CEA
AYT
HLM
CFL
DW
EVI
Fanplay.CN
UPLC`}]},{path:"/ctto.html",title:"赛事工作人员工资",pathLocale:"/",contents:[{header:"赛事工作人员工资",slug:"赛事工作人员工资",content:`提示
这份文件将作为帮助现代战舰赛事工作人员的蓝本，这将适用于所有现代战舰锦标赛服务器，无论服务器的大小和区域如何 范围
工作人员包括但不限于裁判，记录员，直播员服务器助手和组织者，下文将讲述每一种工作人员的报酬`},{header:"前言",slug:"前言",content:`以下所有工资均以“一场比赛“为基础进行说明，一场比赛代表一张地图中两队或两名参赛者之间的一场比赛/战斗，回合是任意数量游戏的组合（例如三局两胜，五局三胜）。默认情况下所有工资都是用游戏中的“金条”支付的 计算工资的例子
假设A队和B队进行三局两胜制（BO3）的比赛，如果A队连续赢了两局比赛那么裁判/记录员/直播员的工资为4002/4002/6002，同样，如果BO3的结果是2-1，那么裁判/记录员/直播员的工资将为4003/4003/6003
根据最近的反馈，我们决定修改工资的计算方式，并将其重组为两种不同的结构，下面提出一个新的工资制度，为1v1，2v2，3v3形式的比赛工资计算为每轮，而不是每场比赛；4v4，5v5的工资结构将按每场计算`},{header:"裁判",slug:"裁判",content:`裁判的主要职责是根据比赛的规则监督比赛，在某些情况下，裁判也有记录员的职责 （1v1，2v2，3v3）锦标赛的裁判工资（每回合比赛） 若不负责录像：每回合比赛450黄金
若负责录像：每回合比赛575黄金 （4v4，5v5）锦标赛的裁判工资（每场比赛） 若不负责录像：每场比赛325黄金
若负责录像：每场比赛425黄金`},{header:"记录员",slug:"记录员",content:"顾名思义，记录员的主要职责是以适合观看的方式记录整场比赛，这些录像将发布到视频平台中，如YouTube，Bilibili或类似的服务提供平台 （1v1，2v2，3v3）锦标赛的记录员工资（每回合） 每回合比赛425黄金 （4v4，5v5）锦标赛的记录员工资（每场比赛） 每场比赛300黄金"},{header:"直播员",slug:"直播员",content:"直播员应在Twitch/YouTube/bilbil/Discord等视频平台上直播比赛，但需要有一些延迟，他们应将直播链接提供给公众观看 （1v1，2v2，3v3）锦标赛的直播员工资（每回合） 每回合比赛600黄金 （4v4，5v5）锦标赛的直播员工资（每场比赛） 每长比赛450黄金"},{header:"服务器助手",slug:"服务器助手",content:"聊天管理员，比赛负责人，助手或其他服务器特定的身份今后将归入“服务器助手”类别，服务器助手可以在比赛组织者的要求下承担上述任何形式的职责，他可能可以管理比赛服务器，也可以帮助组织者完成各种任务，对于半封闭或完全封闭的服务器，根据服务器的不同，也会有不同的例外情况 服务器助手工资：6000黄金/8000黄金为标准 如果担任的是聊天管理员，则每个月工资为6000黄金，如果服务器助手担任的是任何其他的服务器特定身份，则工资为8000黄金，服务器助手不得同时在3个以上的服务器执行任务 服务器助手的数量取决于服务器的大小"},{header:"组织者",slug:"组织者",content:"锦标赛的组织者不得超过3人，如果比赛由3个人组织，必须由一名组织者（主办）负责整个比赛，其余的组织者者称为协办方，他们的工资如下： 主办工资 22000黄金-26000黄金 主办方的工资取决于比赛的复杂程度（比赛级别，比赛地区，比赛形式和比赛时长）考虑到以上因素，主办的工资将算入上述工资中的一项 （1v1，2v2，3v3）锦标赛的主办工资 22000黄金/24000黄金/26000黄金 （4v4，5v5）锦标赛的主办工资 22000黄金/24000黄金 协办工资 20000黄金/22000黄金 协办方将承担与主办相似的职责，他/她将与其他组织者/助手共同分担工作/责任 （1v1，2v2，3v3）锦标赛的协办工资 20000黄金/22000黄金 （4v4，5v5）锦标赛的协办工资 20000黄金"},{header:"工资转换比率",slug:"工资转换比率",content:`参赛者和赛事工作人员的奖励应有灵活性，可以获得以下转换比率的艺术硬币（AC），战斗通
行证和高级账号，员工至少获得1000黄金的收入才能将其转换成艺术硬币（AC） 1000黄金=100艺术硬币（AC）
16000黄金=VIP战斗通行证（紫通）
26000黄金=VIP战斗通行证+通行证40级
8000黄金=30天高级账号`}]},{path:"/CYCT.html",title:"常用词萌新解答",pathLocale:"/",contents:[{header:"常用词萌新解答",slug:"常用词萌新解答",content:""},{header:"点灯",slug:"点灯",content:`严重警告 国际通用行为
航母不点灯你玩呢
真人局不点灯，小心被骂，这是认真的！！！ 点灯（英文：Open map），是一种游戏内对局必须有的做法，意思是指在真人对局中，用自己的直升机（航母用快的飞机）去敌方的阵营，用来发现视野，也就是使敌人让队友看见，多数对局的失败，大部分都是没有点灯的结果，所以一定要点灯。`},{header:"互赞",slug:"互赞",content:`小贴士 在别人发互赞后，记得回复 Okey 或 OK 或 好
每局只能点一个赞哟，请记住互赞方名字
务必要赞哦，滴水之恩有时会涌泉相报 一般会有些玩家，每次在对局前或对局中对局后发一个互赞（有时是英文：like for like，都是中国玩家常用的），这表明，他需要你的点赞，在结算界面，点击玩家，在互赞方名字旁边就有一个点赞按钮，点击变绿就说明点赞了。`}]},{path:"/DE.html",title:"制作人员",pathLocale:"/",contents:[{header:"制作人员",slug:"制作人员",content:`注意
注意辨别`},{header:"MWdocs",slug:"mwdocs",content:"咕咕₦Ɇ₮₣ØӾ MWdocs Developer"},{header:"特别鸣谢",slug:"特别鸣谢",content:"Legosi 贡献者 阿洛awa 贡献者 【欧洲舰队】终极规律号 贡献者 ZEEKR 贡献者 EGG 贡献者 MOMMOMP 贡献者 西伯利鸭 贡献者 枫 贡献者 小土豆 贡献者 上邪 贡献者 トガダ 贡献者 Asterisk 贡献者"}]},{path:"/EGG.html",title:"游戏彩蛋",pathLocale:"/",contents:[{header:"游戏彩蛋",slug:"游戏彩蛋",content:""},{header:"岩峰地图的“彩蛋”",slug:"岩峰地图的-彩蛋",content:""},{header:"水上",slug:"水上",content:""},{header:"水下",slug:"水下",content:""}]},{path:"/Game.html",title:"现代战舰游戏规则",pathLocale:"/",contents:[{header:"现代战舰游戏规则",slug:"现代战舰游戏规则",content:"如果你发现一条船导弹多且全是花岗岩（布拉瓦，GTX690），而且爱玩近战，请尽量远离，否则会有不幸的事发生；也别千万不要依赖防空，因为他水很深，你把握不住 永远不要和一个战列舰玩近战，因为每个战列舰都有一个技能：血条消失术，这会给你带来危险 千万不要跟全是反潜装备的人玩潜艇，不然你会死的很惨，这是非常危险的 绝对不要单充，要充礼包，因为你永远不知道老谢的数学有多好 如果你是战列舰，千万不要靠近花伟鸽，他实在是太危险了 当你看到一个可爱的花伟鸽向你冲来，而且你残血，不用怀疑，他是来要你命的 千万不要用日本语言看日本船，别问为什么，对于我们中国人来说太危险了 如果老谢良心了，那一定是他的妈妈限时回归了，这个时候一定要夸赞他 千万不要去官网充值，别问为什么 如果你想指望老谢一直良心，我劝你放弃这个想法"}]},{path:"/GO.html",title:"你好，舰长",pathLocale:"/",contents:[{header:"你好，舰长",slug:"你好-舰长",content:`介绍
MWdocs 是一个由玩家们发起的面向于玩家的用于记录现代战舰内容的文档网站，主要使用 vuepress2 搭建，它可以帮助玩家快速创建、编辑和发布现代战舰相关的指南攻略等文档资料。与传统纸质版和零碎的现代战舰记录相比，MWdocs 拥有更高度的聚集性与可访问性与可搜索性，并且支持在线评论，自定义主题功能等。此外，如果您需要向不同群体或个人提供攻略或共享现代战舰中存在内容，则还可以将其整合发送给 MWdocs 下的管理组织（MWdocs 组织）以进行审核并发布到网站，从而浏览和协作编辑内容 新动作
MWdocs 正在收集有关现代战舰的任何东西（表情包，名言名句，教程，攻略等）
有兴趣请发送邮件至 netfox@mwodcs.info
任何人都会收到审核，通过者将会在 mwdocs.info/DE.html 上留下你的名字 提示
网站东西会越来越多，可以直接在左侧边栏里点击想看的内容跳转（移动端点击左上角图标即可展开边栏） 主要声明
本网站与 Artstorm 或 Gaijin 或其任何子公司或附属公司没有附属、关联、授权、认可或以任何方式正式关联。 次要声明
本站有些词条、图片等来自玩家/网络中收集，不会用在任何商业地方，本意是为了让更多玩家了解游戏，如需注明来处，请联系管理员 netfox@mwdocs.info`},{header:"游戏介绍",slug:"游戏介绍",content:`在史诗般的海战中，在线控制最棒的现代舰艇和战机！
创建舰队，召集你的朋友，赢得小队之间的战斗，赢得锦标赛的冠军，成为现代战舰中的传奇！ 您在游戏中将体验到： 真实的在线PvP战斗 在与来自世界各地的玩家的激烈海战中证明自己是佼佼者，海战如同现实世界中一般真实。 收集舰艇和战机 根据实际型号和设计收集200多种现代舰艇和飞机：来自12个以上国家的轻型护卫舰、护卫舰、驱逐舰、战列舰、航空母舰、潜艇、地效飞行器、无人机、隐形战斗机和战略轰炸机。 坚不可摧的舰队 使用强大的定制系统，可以升级舰艇和战机的属性/装备，包括武器系统：导弹、火炮、火箭发射器、鱼雷发射器-300多种真实武器！ 始终身处战斗中心 在一场战斗中，在几种类型的载具之间无缝切换（例如，从控制船只切换到控制直升机，反之亦然）。 逼真的画质 体验高度细节的舰艇和载具模型壮观战斗-它们在型号广泛的设备上都看起来很漂亮。 我们很高兴地宣布，可以从我们的网站上购买Android设备的官方apk版本的游戏内购内容！
为了回应玩家的愿望，我们添加了Xsolla服务作为支付手段，从而解决了谷歌限制游戏内购买的问题。
安卓设备的官方apk版本，已对接Xsolla支付服务。
Xsolla是一项付款受理服务。该公司的合作伙伴是全球2000多名开发人员。该公司支持130种不同货币的700多种支付方式，并在200多个国家提供20种语言的服务。
下载官方安装包，安装游戏，畅玩游戏并随您所愿进行消费，不受任何限制！`}]},{path:"/",title:"",pathLocale:"/",contents:[{header:"—————— MWdocs 新闻 ——————",content:`UTC+8 2023年6月24日 【玩家自制: 流浪地球改编】【置顶】
MW全球广播：
这里是艺术风暴公司，在面向全球做最后播报，在过去的2年里，玩家经历了有史以来最大的MW危机。在全球各国七十万玩家的的拼搏和牺牲下，71%的抗议人员和100%的玩家被全部激怒，但遗憾的是，目前老谢的平衡变动将会获得的收益已经超过失去老玩家造成的损失。玩家，错失了最后的成功机会。为了MW文明之延续，550M将启动“坦克模式”计划。策划们都是地球的英雄，玩家谨记于心，以你们为荣，我们将肩负着你们全部的希望，飞向两千五百年后的新坦克模式，万事万物总有始终，在MW毁在老谢手里的的最后七天里，大家回家吧，玩玩自己喜欢的战舰，亲亲自己的游戏好友。与大家团聚，好好告别，祝大家好运！
播报完毕，再见！ UTC+8 2023年6月27日 【谢尔盖工作操劳过度躺在病床上】 注
MW的海战和陆战由不同团队负责。目前谢尔盖个人只负责陆战开发，不影响海战进程。`}]},{path:"/IOS.html",title:"日区Apple ID注册教程",pathLocale:"/",contents:[{header:"日区Apple ID注册教程",slug:"日区apple-id注册教程",content:`需要准备的东西 一个长期可以使用的，没有注册过Apple ID的邮箱，请不要使用共享邮箱
一个本人使用的手机号，可以是中国大陆手机号，也可以是Google Voice，注册过其它Apple ID的也可以（只要不是太多），请不要使用共享手机号
一部运行iOS 10.3或以上的设备
全程不需要科学上网，所以不用打开小火箭等软件哦
(可选)前几步用电脑操作会更舒服`},{header:"注册步骤",slug:"注册步骤",content:`登录Apple官网以注册一个新的Apple ID 国家或地区部分请选择日本，其它信息按照页面指示正常填写即可！如果提示「无法使用此电子邮件地址」，说明这个邮箱已经注册过了，换一个邮箱即可 打开您iOS设备中的App Store，关闭科学上网，登录刚刚注册的Apple ID 系统会弹窗提示您该Apple ID需要进行首次使用的设置，点击设置；下一步进去会让您同意Apple ID使用协议，滑动按钮同意，点击右上角进入下一步 重点！！！ 在这步的信息填写中，第一个选项是让您选择您的付款信息，两个都不要点！！直接在下方填写信息就可以！如果不小心点了可以点击左上角返回上一步，然后再点下一步回到该页面！ 信息填写参考：
- 姓（フリガナ）：コンマイ - 名（フリガナ）：サイコウ - 姓：Konmai - 名：Saikou - 住所1：Konmai - 住所2：（留空） - 市区町村：Konmai - 都道府県：大阪府 - 郵便番号：000-0000 - 電話番号：000 0000-0000 填写完后点击下一步，然后您的日服Apple ID就成功激活并且可以使用了！！`},{header:"IOS保留游戏数据并更新国区下架游戏的教程",slug:"ios保留游戏数据并更新国区下架游戏的教程",content:""},{header:"该方法仅适用于iOS 10.3或以上，且不适用于全区下架的游戏",slug:"该方法仅适用于ios-10-3或以上-且不适用于全区下架的游戏",content:""},{header:"请确认您还记得当时下载游戏使用的国区Apple ID的密码",slug:"请确认您还记得当时下载游戏使用的国区apple-id的密码",content:""},{header:"每次更新都需要重新输入国区密码，如果想一劳永逸请彻底删除游戏并从外区重新下载",slug:"每次更新都需要重新输入国区密码-如果想一劳永逸请彻底删除游戏并从外区重新下载",content:"进入设置-iPhone/iPad/iPod储存空间-找到您想要更新的应用 选择「卸载App」，注意不是下面的「删除App」，卸载是会保留游戏数据的；如果这步没有卸载但不删除数据的选项代表设备系统版本较低，不支持，只能彻底删除后切换外区下载 切回主页面，找到你卸载的App的图标，然后单击。此时系统会让您验证当时下载游戏时使用的Apple ID的密码，输入密码验证后，游戏即会开始下载新版。"},{header:"关于国区下架游戏使用国区账号氪金",slug:"关于国区下架游戏使用国区账号氪金",content:"目前情况，国区下架的游戏仍然可以使用国区账号氪金"}]},{path:"/JC.html",title:"问题引导",pathLocale:"/",contents:[{header:"问题引导",slug:"问题引导",content:""},{header:"礼包码窗口呢？",slug:"礼包码窗口呢",content:"只有在官方发布礼包码的时候才会开放，正常一般会关闭窗口"},{header:"下载游戏？",slug:"下载游戏",content:"游戏下载 -> 手机端下载"},{header:"头衔获取方法？",slug:"头衔获取方法",content:"比赛 -> 头衔"},{header:"游戏充值？",slug:"游戏充值",content:"其他 -> 充值"},{header:"坦克模式什么时候来？",slug:"坦克模式什么时候来",content:"其他 -> 坦克"},{header:"IOS注册外区账号？",slug:"ios注册外区账号",content:"常用解惑 -> IOS注册"}]},{path:"/JD.html",title:"舰队",pathLocale:"/",contents:[{header:"舰队",slug:"舰队",content:""},{header:"舰队有什么用？",slug:"舰队有什么用",content:"舰队是一种将玩家团结成一个团体的社区。对于舰队成员，可以使用内部聊天和统计图表。"},{header:"舰队在赛季结束时会获得哪些奖励？",slug:"舰队在赛季结束时会获得哪些奖励",content:"目前，没有提供奖励。将在未来开发舰队机制。"},{header:"创建舰队必须满足哪些要求？",slug:"创建舰队必须满足哪些要求",content:`玩家必须达到游戏帐户的10级
玩家不得是任何其他舰队的成员
玩家必须支付10000黄金才能创建一个舰队`},{header:"舰队中的角色是什么？",slug:"舰队中的角色是什么",content:`舰队队长———拥有舰队的完全访问权限。
管理员———可以批准/拒绝舰队资格请求。可以发送舰队邀请。
成员———军团的普通成员。`},{header:"战队评级",slug:"战队评级",content:"根据舰队成员的活动，舰队成员的最大数量增加。在舰队的第 10 级，最大成员人数 - 200。"},{header:"我不小心删除了舰队，是否可以恢复我的舰队或返还创建舰队的金币？",slug:"我不小心删除了舰队-是否可以恢复我的舰队或返还创建舰队的金币",content:"不可以，移除军团是不可逆转的，无法恢复。"},{header:"是否可以将舰队的领导权转移给另一个人？",slug:"是否可以将舰队的领导权转移给另一个人",content:""},{header:"目前，舰队领导权的转移只能通过支持代理进行。舰队队长必须留下更改舰队队长的申请。必须包含：",content:`舰队编号
舰队队长ID
舰队队长将转移的玩家的ID。 小贴士
支持代理可能会要求您提供其他数据，以确保您是真正的军团领袖。`},{header:"舰队活动点数是如何计算的？",slug:"舰队活动点数是如何计算的",content:`舰队活动点数仅在快速游戏模式下摧毁真实玩家时获得。（真实玩家有ID）
杀死一名舰队成员玩家将获得 10 点军团活动点数。杀死普通玩家将获得5个部落活动点数。`},{header:"我可以使用现有舰队的名称和军团标签吗？",slug:"我可以使用现有舰队的名称和军团标签吗",content:"不可以，禁止复制现有军团的名称和舰队标签。这些舰队的名称将被更改。"}]},{path:"/LJ.html",title:"现代战舰网站",pathLocale:"/",contents:[{header:"现代战舰网站",slug:"现代战舰网站",content:""},{header:"官网",slug:"官网",content:"https://artstorm.com/zh-CN/"},{header:"Discord",slug:"discord",content:"https://discord.gg/modernwarships"},{header:"Facebook",slug:"facebook",content:"https://www.facebook.com/groups/artstormofficial/?ref=share&mibextid=NSMWBT"},{header:"Youtube",slug:"youtube",content:"https://youtube.com/@Modern_Warships"},{header:"Vk",slug:"vk",content:"https://vk.com/artstormfze"},{header:"Twitter",slug:"twitter",content:"https://twitter.com/ModernWarships?s=09"},{header:"Linkedin",slug:"linkedin",content:"https://www.linkedin.com/company/artstormfze"},{header:"Telegram",slug:"telegram",content:"https://t.me/MW_ARABS_CHANNEL"},{header:"Mwdocs",slug:"mwdocs",content:"https://mwdocs.info"},{header:"Reddit",slug:"reddit",content:"https://www.reddit.com/r/ModernWarships"},{header:"Mwstats",slug:"mwstats",content:"https://mwstats.info/ships?lang=zh-hans"},{header:"Google",slug:"google",content:"https://play.google.com/store/apps/details?id=com.Shooter.ModernWarships"}]},{path:"/LS.html",title:"游戏重大历史",pathLocale:"/",contents:[{header:"游戏重大历史",slug:"游戏重大历史",content:`提示
收录时间2023年6月24日`},{header:"游戏平衡大改",slug:"游戏平衡大改",content:""},{header:"全部三级船雷达、声呐平衡改动",slug:"全部三级船雷达、声呐平衡改动",content:`船名称
雷达距离
声呐距离 乌沙科夫
12 - 9.6
1.36 - 2.8 最上级
12.8 - 9.6
1.36 - 2.4 戈尔什科夫
13.6 - 8.4
1.36 - 2.8 F126
12.8 - 9.6
2 - 1.6 F127
12.8 - 8.8
1.36 - 2.4 蓝鲨
14.4 - 10.4
1.36 - 2 朱母
13.6 - 10.4
1.36 - 0.8 055
13.6 - 8.8
1.36 - 2.4 2145
13.6 - 8.8
1.36 - 1.2 83式
12 - 8.8
1.36 - 1.2 正祖大王
13.6 - 8.8
1.36 -2.8 爱宕
14.4 - 11.2
1.36 - 0.8 DDGX
13.6 - 8.8
1.36 - 2 宪法号
12 - 10.4
2.16 - 0.8 维拉湾
12 - 9.2
1.36 - 2.8 领袖
13.6 - 8.8
1.36 - 2.8 058
13.6 - 10.4
1.36 - 1.2 055A
14.4 - 8.8
1.36 - 1.6 麒麟
12.8 - 8.8
1.36 - 1.6 DDX
13.6 - 8.8
1.36 - 1.6 剑船
13.6 - 8
1.36 - 1.6 皇家港
12 - 10.8
1.36 - 2.8 CGX21
13.6 - 10.4
1.36 - 0.8 密苏里
12.8 - 8
2.16 - 0.8 海洋复仇者
12 - 8
1.36 - 0.8 罕舰
12.8 - 8
2.16 - 2.4 武库
15.2 - 8.8
1.36 - 1.6 光荣
14.4 - 11.2
1.36 - 2.4 莫斯科
15.2 - 8
2.16 - 无改动 美国级
12 - 8.4
1.36 - 2 福特级
12.8 - 7.2
2.16 - 1.6 乌里扬
8 - 7.6
2.16 - 2.4 彼得大帝
12.8 - 8
1.36 - 2.8 马萨诸塞
13.6 - 8
2.16 - 2 CVX
10.4 - 8.4
1.36 - 0.8 Anchar1199
12 - 8.8
1.36 - 2.8 076
12 - 8
1.36 - 2.4 003
9.6 - 8
2.16 - 2.4 出云
12 - 8.4
1.36 - 2.8 FS DCNS
12 - 8.4
1.36 - 0.8 企业
8.8 - 7.2
2.16 - 1.2 暴风级
7.2 - 无改动
2.16 - 1.6 004
8 - 7.1
2.16 - 1.2 纳西莫夫
12.8 - 9.6
1.36 - 1.6 复仇女神
11.2 - 8
2.16 - 1.6 瑞鹤
8 - 7.2
2.16 - 1.2 宙斯盾大和
15.2 - 8
2.8 - 1.2 北风之神
17.6 - 11.6
1.6 - 无改动 台风
16 - 10
1.6 - 无改动 俄亥俄
14.4 - 10.8
1.6 - 2 094
14.4 - 11.2
1.6 - 1.2 096
15.2 - 10
1.6 - 2.8 100式
20 - 8.8
1.6 - 无改动 smx31
17.6 - 11.2
1.6 - 3.2 哥伦比亚
14.4 - 10
1.6 - 2 smx25
17.6 - 10.8
1.6 - 无改动`},{header:"汇总三级船血量：",slug:"汇总三级船血量",content:`乌沙科夫：409500
戈尔什科夫：390000
最上：409500
F126：409500
F127：390000
蓝鲨：390000
朱姆沃尔特：461500
055：442000
足柄：461500
DDGX：448500
宪法：468000
1199：455000
2145：442000
领袖：442000
058：455000
055A：448500
麒麟：455000
DDX：455000
83：474500
正祖大王：448500
剑船：442000
海洋复仇者：461500
72：494000
73：513500
瓦良格：507000
大帝：520000
纳西莫夫：526500
CGX：533000
武库：546000
麻省：520000
密苏里：572000
罕舰：565500
莫斯科：520000
大和：598000
宙斯盾大和：526500
美国：513500
福特：552500
乌里扬诺夫斯克：520000
福建：546000
CVX：520000
076：494000
出云：507000
法航：539500
仇富女神：559000
俄亥俄：409500
北风：422500
台风：468000
094：409500
096：429000
100：481000
哥伦比亚：416000
丧门星31：390000
丧门星25：409500
企业：552500
风暴：526500
004：546000
瑞鹤：559000`},{header:"二级加武器汇总（其中可能有记错的）：",slug:"二级加武器汇总-其中可能有记错的",content:`格拉德.斯维亚日斯克：导弹1→2
独立：鱼雷1→2
格里戈洛维奇海军上将：导弹1→2，增加1鱼雷
智者雅罗斯拉夫：鱼雷1→2
052H2G：导弹1→2，新增1火箭
054A：导弹1→2，新增1鱼雷
F123：鱼雷增加到3
阿利伯克：增加1鱼雷
格雷夫利：导弹1→2
厦门：鱼雷1→2
邓肯：导弹1+1→2+1
金奈：鱼雷增加至2
KDDX：鱼雷增加至2
尼米兹：增加无人机
库兹涅佐夫：导弹1→2
山东：火箭增加至3，多加一个新的直升机格子
伊丽莎白：增加一个新的直升机格子
海狼：增加1个新的导弹格子
梭鱼：增加一个新的鱼雷格子
636：导弹1→2
092：鱼雷1→2`},{header:"三级武器格子变动汇总",slug:"三级武器格子变动汇总",content:`戈尔什科夫导弹改为3+1，鱼雷2→3，9K96堡垒锁定防空1→2
最上级鱼雷2→3
朱姆沃尔特级驱逐舰导弹2→4
现代级乌沙科夫海军上将鱼雷1→2
055南昌舰导弹+1（2+1布局），添加2鱼雷
爱宕级足柄号鱼雷1→3
宪法添加1导弹槽位：导弹2→3+1
1199驱逐舰导弹2→3
2145驱逐舰S400锁定防空1→2
23560领袖级导弹2+1布局→2+2布局
055A驱逐舰导弹2+1布局→3+1布局
83型驱逐舰鱼雷1→2
剑船1+1鱼雷→2+2鱼雷
CG-72添加2鱼雷
CG-73导弹1+1+1布局→2+1+1布局，添加2自动炮，添加一个1×3防空槽位
光荣级巡洋舰导弹2→3，火箭炮2→3，防空2+4+2→3+5+3
彼得大帝巡洋舰鱼雷2→3
纳西莫夫海军上将巡洋舰
导弹2+1→2+2，火箭炮2→3
密苏里导弹1+1→2+1
美国级两栖登陆舰添加1导弹
福特级添加1导弹，添加1无人机自卫炮5→7，防空5+2→6+4
乌里扬诺夫斯克添加5自卫炮
003福建舰，添加1无人机槽位，添加2自卫炮槽位
CVX直升机母舰导弹2→3，添加1无人机槽位
出云级直升机驱逐舰添加2鱼雷槽位
复仇女神航母，攻击机1→2
DCNS航母添加1无人机槽位
北风之神导弹2+1→3+1
094型核潜艇导弹1+1+1→2+1+1
SMX25导弹2+1→3+1
暴风级突击型航母锁定S-400垂发防空1→3`}]},{path:"/LT.html",title:"聊天",pathLocale:"/",contents:[{header:"聊天",slug:"聊天",content:""},{header:"游戏内聊天从什么级别开始？",slug:"游戏内聊天从什么级别开始",content:"玩家可以在 10-12 级进行游戏内聊天。这取决于地区，出于安全原因，某些国家/地区稍后可以使用聊天。"},{header:"我被无缘无故屏蔽了，如何屏蔽我的聊天？",slug:"我被无缘无故屏蔽了-如何屏蔽我的聊天",content:"如果您确定阻止不合法 - 请联系管理员。"},{header:"如何更改可用的聊天语言？",slug:"如何更改可用的聊天语言",content:"可用的区域聊天取决于设备的语言。"},{header:"我在哪里可以阅读聊天规则？",slug:"我在哪里可以阅读聊天规则",content:"在聊天室的右上角，点击“？”符号"},{header:"为什么玩家被禁止进入聊天室？",slug:"为什么玩家被禁止进入聊天室",content:`该玩家在聊天中违反了一些行为准则，因此他的聊天被暂时阻止。(4天或以上)
友善，帮助新人，尽量不要回应侮辱。`},{header:"聊天室中禁止以下消息：",content:`对玩家的个人侮辱
诽谤
侮辱国籍、宗教、种族
死亡威胁
种族主义言论
政治帖子和挑衅性口号
侮辱游戏开发者和管理员
垃圾邮件
明显的挑衅和燃烧
过度有毒的玩家，扰乱社区互动
禁止复制开发人员和游戏管理部门名称的昵称，以及挑衅或冒犯性的昵称`}]},{path:"/mod.html",title:"手机端下载",pathLocale:"/",contents:[{header:"手机端下载",slug:"手机端下载",content:""},{header:"Android",slug:"android",content:""},{header:"Android（谷歌商店）",slug:"android-谷歌商店",content:"https://play.google.com/store/apps/details?id=com.Shooter.ModernWarships"},{header:"Android（华为商店）",slug:"android-华为商店",content:"https://appgallery.huawei.com/app/C104642661"},{header:"Android（官网下载）",slug:"android-官网下载",content:`https://artstorm.com/zh-CN/
卡？试试加速源（下方）`},{header:"Android（加速源）",slug:"android-加速源",content:`由MWCT-TO提供
https://mirrorimage.mwtour.net/zh-CN/ 无法访问？应该是提供方没钱了（doge`},{header:"IOS",slug:"ios",content:""},{header:"iOS（应用商店）",slug:"ios-应用商店",content:`https://apps.apple.com/us/app/modern-warships/id1541751298
如果商店内没有现代战舰，请看外区IOS账号注册`},{header:"安装包常见问题",slug:"安装包常见问题",content:""},{header:"安装过程中出现“安装未完成”“安装失败”“应用未安装”甚至安装程序直接关闭等情况的解决办法",slug:"安装过程中出现-安装未完成-安装失败-应用未安装-甚至安装程序直接关闭等情况的解决办法",content:"空间不够安装MW，清理手机储存空间确保至少1-2G的储存空间。 存在签名冲突，不一致的MW应用，请删除旧的MW应用程序后再次安装。 安卓版本较低无法兼容（极少数）"},{header:"多次正常游戏结束后没有收益，匹配秒进离线，队友全人机。",slug:"多次正常游戏结束后没有收益-匹配秒进离线-队友全人机。",content:"请确保网络环境正常，root模式下需要对MW应用程序隐藏root权限。 一些模拟器环境也会出现该情况，请检查是否涉及到root权限（如上）"},{header:"打开游戏后闪退，无法进入游戏",slug:"打开游戏后闪退-无法进入游戏",content:"Android/data文件夹内的游戏数据包文件不完整或损坏，需要重新下载安装游戏。"},{header:"打开游戏后出现白屏，提示“download failed because the resources could not be found”",slug:"打开游戏后出现白屏-提示-download-failed-because-the-resources-could-not-be-found",content:"Android/data文件夹内的游戏数据包文件缺失，游戏不完整，建议重新下载安装游戏。"}]},{path:"/musk.html",title:"特殊活动模式",pathLocale:"/",contents:[{header:"特殊活动模式",slug:"特殊活动模式",content:""},{header:"空天航母模式",slug:"空天航母模式",content:`更新0.59〔空天母舰对战活动模式〕已在Google Play上发布！Apple Store和App Gallery也将很快收到更新。
这次更新加入了震撼人心的空天母舰对战模式，以及MW有史以来最激烈的空战！
一张新地图，专门为活动和新模式制作-巨兽之战！ 新地图不仅尺寸惊人，细节质量也令人惊叹——这对我们来说是一个进步！漂浮的岛屿，一天中不断变化的时间-这只是你会发现的一小部分！ 新的据点占领玩法：征服模式！ 各队将以相同的分数开始比赛。为了取得胜利，你必须消灭敌人的队伍，或者夺取并守住比敌人更多的基地，直到他们耗尽点数。 如果两队攻下的基地数量相同，则分数不会变化。 要占领据点，您必须进入雷达上显示的据点区域。任何参与战斗的游戏单位都可以进行据点占领。 只要有一个敌方单位在占领区内，就无法夺取或占领据点。 如果来自同一队伍的多个玩家参与了占领，则占领据点的速度将加快。 你的队伍攻下和守住的据点越多，敌方队伍失去分数越快。 新的马斯克号航母（CVN-X）是一艘来自未来的空中航空母舰！ 一种全新的3D玩法，空天母舰可以改变其飞行高度！ 在船头有一对强大的远程轨道炮，可以对各个角度射击！ 对于核爆炸爱好者来说，船上有一枚配套的核导弹！一次位置良好的打击可以摧毁敌人的等离子推进器，从而使驾驶空中航空母舰更加困难！ 还有用于近战的导弹——你可以向敌人的脸上发射一整群导弹。 大量不同的防空系统——激光、导弹、机枪——都安装在舰艇周围！ F-35攻击机在战斗中不会让敌人安心躺平。 未来独一无二的直升机，用高斯线圈炮摧毁敌机！ 新型攻击直升机CH-1“铜斑蛇” 令人惊叹的未来设计和高速。 强大的高斯线圈炮-可对空射击，而且不仅仅如此！ 机载武器 一对带有非制导导弹的发射器 这款直升机可以免费获得，并且可以在任何游戏模式下使用！ 新的消耗品-烟幕弹 航空母舰可以释放烟雾，这将产生干扰并阻止敌人将导弹瞄准目标。记住，烟雾无法规避已经向你发射的导弹。 这个消耗品是免费的，每次新的战斗都会自动补充。 新机制：物品掉落！ 我们增加了新的机制，每个玩家都可以获得独特的奖品。在战斗后统计窗口中赢得一场战斗后，玩家有较小的机会获得特殊奖励。主要条件是战斗胜利！ 收益加成已经添加-为那些希望将自己的运气发挥到极致的人！ 通过购买和激活任何收益加成，您不仅可以获得收益提升，还可以增加在活动中获得独特奖励的机会！ 错误修复： 修正了大和宙斯盾的主炮——此前，当舰只脱离探测范围时，会显示火炮模型。 激光和机关枪防空不起作用，现在一切都很好。 修复了FS剑船和项目2145上的碰撞盒——以前的导弹在向这些船射击时经常会无法命中。 船上的视觉错误修复 优化： 我们已经改进了许多方面，现在设备上的负载将减少。`},{header:"复活节模式",slug:"复活节模式",content:`指挥官们，您好！
关于新复活节活动的一些重要消息： 更新0.63.1版本可在各官方认可渠道下载，包括我们的网站artstorm.com。活动在游戏内，安装更新后即可开始游玩。 由于更新延迟，我们决定将模式延长24小时，直到国际时间4月21日，23:59，以便您有足够的时间游玩活动并获得奖励。 一些玩家可能丢失了他们的活动进度和复活节彩蛋。给您带来的不便，我们深表歉意。这个错误已经修复，补偿将很快发送给所有受影响的玩家。`},{header:"周年庆模式",slug:"周年庆模式",content:"和复活节模式一个货色"},{header:"端午节模式",slug:"端午节模式",content:"和复活节模式一个货色"}]},{path:"/MWben.html",title:"现代战舰三蚌",pathLocale:"/",contents:[{header:"现代战舰三蚌",slug:"现代战舰三蚌",content:""}]},{path:"/news.html",title:"嗯....你怎么看？",pathLocale:"/",contents:[{header:"嗯....你怎么看？",slug:"嗯-你怎么看",content:""},{header:"杂志",slug:"杂志",content:""},{header:"央视",slug:"央视",content:""}]},{path:"/pan.html",title:"版权装备",pathLocale:"/",contents:[{header:"版权装备",slug:"版权装备",content:""},{header:"阿尔戈纳斯（ARGONAS）",slug:"阿尔戈纳斯-argonas",content:""},{header:"来源",slug:"来源",content:""},{header:"介绍",slug:"介绍",content:`Argonas是一种大型地面效应飞机，旨在快速向水面和沿海地面部队提供支援作战火力。阿尔戈纳斯的特征不是确定的。配置设计工作的目的是了解这种车辆需要哪些不同的功能。而且，更重要的是，发现交叉点和机会，以彻底整合技术，并创造一种新的物理形式，其性能不仅仅是其各部分的总和。
Argonas is a large ground effect aircraft designed to rapidly deliver supporting combat firepower to surface and coastal ground forces. The features of the Argonas are not definitive. The purpose of the configuration design effort is to understand what different features would be needed in such a vehicle. And, more importantly, discover the intersections and opportunities to thoroughy integrate technologies and and create a new physical form that performs as more than a sum of it’s parts.`},{header:"图片",slug:"图片",content:""},{header:"杀戮时刻（KILLSWITCH）",slug:"杀戮时刻-killswitch",content:""},{header:"来源",slug:"来源-1",content:""},{header:"介绍",slug:"介绍-1",content:`一种虚构的近未来可变几何飞机，旨在促进娱乐和虚拟体验中的复杂角色、叙事和决策。
A fictional, near-future variable-geometry aircraft, designed to facilitate complex characters, narratives and decision-making in entertainment and virtual experiences.`},{header:"图片",slug:"图片-1",content:""}]},{path:"/PC.html",title:"电脑端下载",pathLocale:"/",contents:[{header:"电脑端下载",slug:"电脑端下载",content:""},{header:"2023年6月16日",slug:"_2023年6月16日",content:`提示
俄区已发布PC端B测报名表，简中区的各位请耐心等待，先前已与安德烈谈妥，简中会有独立的报名表，预计稍晚些会以腾讯文档收集表形式发布 指挥官们！
我们很高兴地宣布开放现代战舰PC版alpha测试第二阶段的招募
这一次，我们邀请所有拥有PC的玩家通过测试资格。
通过表格完成调查。提供您的游戏ID和电子邮件地址，该地址附加到您的现代战舰帐户。小心，因为这封电子邮件将在PC版本中用于授权。
如果您没有分配给您的帐户的电子邮件地址，请使用Modern Warships移动版本在帐户设置中分配它。为此，请转到设置->帐户->添加电子邮件。
之后，等待关于alpha测试第二阶段开始的消息，并在移动版MW中查看您的游戏内电子邮件。那些被选中进行测试的人将收到一封游戏内电子邮件。在那封电子邮件中，您将找到有关如何下载和安装PC版本的进一步说明。
提前感谢您对项目生活的兴趣和参与！
链接到表格（谷歌问卷）：https://mw.live/pcfrm 警告
所有链接到时均会失效`},{header:"2023年6月13日",slug:"_2023年6月13日",content:`大家好！
我们想通知您，PC 版《现代战舰》的第一阶段测试已接近尾声。 这意味着第二阶段即将开启，申请并通过选拔的玩家将可以进入。
有关第二阶段测试开始和申请开放的信息将于本周在主要的现代战舰社交网络上发布。
请继续关注我们的更新，这样您就不会错过测试您最喜欢的游戏的 PC 版本的机会！`},{header:"2023年6月5日",slug:"_2023年6月5日",content:`运营安德烈：
Yes. We do plan to open testing to different players. Not just CC members.
好消息，好消息，PC端B测将不仅限于面向创作者开放。
We will make a survey form and select the appropriate candidates ourselves.
届时将以调查表形式收集有意向参与PC端B测的玩家报名信息，并由开发者亲自筛选。
Yes. And please tell them to wait for the official news. They'll know everything from there!
请将以上喜讯告知广大玩家，并且呼吁玩家们随时关注官方情报，后续将会公布详情细则！`},{header:"2023年6月1日",slug:"_2023年6月1日",content:"PC端的A测已开始，且测试结果对外封闭"},{header:"2023年5月31日",slug:"_2023年5月31日",content:`指挥官们！
经过数月的努力，我们的团队很高兴地通知您，PC 版《现代战舰》的开发已经结束！
你会发现更新和详细的图形，使用键盘和鼠标或游戏手柄的方便控制，以及与游戏的移动版本的完全跨平台。
PC版很快就会进入封闭alpha测试。
第一阶段的测试将由一小群最有经验的玩家组成，将持续大约一周。
第二阶段的测试计划范围更广。 拥有PC并通过我们选拔的玩家将能够参与其中。 我们将开放接受申请，并在 Modern Warships 的主要社交网络上通知您。
关注我们的更新，这样你就不会错过任何东西！`}]},{path:"/QT.html",title:"其他",pathLocale:"/",contents:[{header:"其他",slug:"其他",content:""},{header:"兑换码有什么用？",slug:"兑换码有什么用",content:`兑换码用于庆祝游戏中的重要事件，以及激励新玩家。
有时会向内容创作者和大型社区所有者提供兑换码。所有兑换码都有有限的期限和使用次数。
我们不会应要求提供有效的兑换码列表。玩家必须自己找到当前的兑换码。我们不提供单一的有效兑换码列表。`},{header:"阿尔法测试",slug:"阿尔法测试",content:"Alpha 测试是一项封闭测试，在发布新版本游戏之前是必需的。目前没有招募测试计划。2022 年 9 月，为了更有效地工作，alpha 测试参与者的数量已经减少。"},{header:"如何成为游戏版主？",slug:"如何成为游戏版主",content:"游戏版主只能由项目管理部门任命。我们不积极招募版主。版主从常规和以积极的方式证明玩家的数量成为用户。"},{header:"为什么我的每日奖励日历无法正确显示？即使奖项在日历上标记为“已收到”，我也没有收到奖励？",slug:"为什么我的每日奖励日历无法正确显示-即使奖项在日历上标记为-已收到-我也没有收到奖励",content:"每日奖励日历每两个月更改一次，每个玩家将有不同的日期。如果更改发生在日历的中间，您收到的奖励可能与您收到的奖励不同，因为您是从另一个日历收到的，并且您将从新日历中获得未来的奖励。"},{header:"每日任务",slug:"每日任务",content:`每日任务的复杂性随着账户级别的增加而增加。
玩家每天最多有机会完成5次任务。为了提前开始完成新任务，请单击主菜单中的相应图标。
此外，随着等级的增加，“跳过”每个任务和整个任务块的成本也会增加。`},{header:"坦克模式什么时候来？",slug:"坦克模式什么时候来",content:"坦克模式目前正在开发中，迫不及待地想发布它们！这不是一项快速的任务，但团队实际上正在日以继夜地工作，以尽快发布它们。"},{header:"机器人太强了，偷走了我的人头。",slug:"机器人太强了-偷走了我的人头。",content:"机器人的选择取决于您的技能。尝试改变战术，如果你正在与对手战斗，并且你旁边有一个机器人可以偷走你的人头。当你看到对手的生命值接近零时，停止射击并确保最后一枪是你的。"},{header:"你的配对有什么问题？为什么是不平等的？低级玩家遇到高水平玩家。",slug:"你的配对有什么问题-为什么是不平等的-低级玩家遇到高水平玩家。",content:"在MW中，对手的选择是基于玩家的技能，而不是他们的水平。精通度会根据玩家最近的输赢不断重新计算，这可确保玩家与同一玩家匹配。战术和技巧在游戏中非常有价值。有时，如果具有相同技能水平的玩家不能立即可用，您将被更高级别的玩家选中。"},{header:"我无法支付游戏内购买/下载游戏的费用",slug:"我无法支付游戏内购买-下载游戏的费用",content:`我们有一个官方网站，您可以在其中使用游戏中的用户名和密码登录。有所有的特别优惠和许多付款方式。您也可以从我们的网站下载官方游戏客户端。 建议
不要去官网充值，别问为什么，问就是贵，死贵`},{header:"我没有查看广告按钮，为什么？",slug:"我没有查看广告按钮-为什么",content:""},{header:"尝试通过重置“广告ID”来解决它：",content:`打开手机设置
找到“谷歌”，然后点击它
点击“广告”
点击“重置广告ID”，然后点击“确定” 小贴士
如果这没有帮助，则表示确实没有广告，或者您所在地区目前可能没有广告。`}]},{path:"/SC.html",title:"市场",pathLocale:"/",contents:[{header:"市场",slug:"市场",content:""},{header:"如何购买商品？",slug:"如何购买商品",content:`要购买商品，请转到“市场”选项卡，然后单击您感兴趣的商品。点击“购买”按钮为该商品报价。按下“确认”按钮后，将从您的游戏帐户中扣除一定金额，直到购买物品或请求到期。（72小时）。
购买时，您指定所需的价格，当出现该价格的装备时，您会自动购买它。
您也可以通过在请求/报价列表中单击您感兴趣的商品右侧的“购买”来购买没有订单的商品。`},{header:"如何出售商品？",slug:"如何出售商品",content:`符合条件的商品可以从市场主页的“库存”选项卡进行销售。 小贴士
请注意，在出售商品时，您将被收取20%的佣金，在指定价格时要考虑到这一点。另请记住，船上安装的所有设备将与物品一起出售。未安装在船上的伪装和旗帜也将在出售时消失。您可以指定您的价格并等到买家来，或者您可以指定其他玩家已经提供的价格，然后您的报价将立即生效。`},{header:"如何从市场上撤下商品？",slug:"如何从市场上撤下商品",content:"您出售的所有商品都显示在市场页面的“我的报价”->“出售”部分中。您可以从市场上删除其中任何一个，并通过单击“删除”按钮将它们返回到您的库存中。"},{header:"我如何取消在市场上进行的交易或取回我的钱？",slug:"我如何取消在市场上进行的交易或取回我的钱",content:"所有交易均为最终交易。您无权获得通过市场进行的交易的任何退款或取消。"},{header:"谁可以使用市场？",slug:"谁可以使用市场",content:`游戏帐户必须至少为 7 级。
必须至少一种授权方法连接到游戏帐户。（该帐户不得是游客帐户）。
游戏帐户上的艺术币不得为负值。`},{header:"玩家之间可以以自己的价格进行交易吗？",slug:"玩家之间可以以自己的价格进行交易吗",content:"直销不是市场机制的一部分。"},{header:"我没有进行任何交易。但是我所有的艺术币都不见了。",slug:"我没有进行任何交易。但是我所有的艺术币都不见了。",content:"通过转到市场>我的订单>买入来检查您的买入订单。创建采购订单时，将从您的帐户中扣除该金额。"},{header:"为什么我不能在市场上买船？“购买”按钮处于非活动状态。",slug:"为什么我不能在市场上买船-购买-按钮处于非活动状态。",content:"这艘船已经在您的库存中。一个帐户不可能有两艘类似的船。"},{header:"为什么我在出售商品时看不到所有商品？",slug:"为什么我在出售商品时看不到所有商品",content:"只有独特的战斗通行证物品可供出售。"},{header:"我可以在账户之间转移艺术币吗？",slug:"我可以在账户之间转移艺术币吗",content:"禁止将Artcoin从一个帐户转移到另一个帐户，即使这些帐户是您的帐户。此类操作可能会导致帐户被禁止。"},{header:"为什么我的一些物品不能出售？",slug:"为什么我的一些物品不能出售",content:"只有战斗通行证物品可供出售，直到下一个赛季，您将无法出售当前战斗通行证中的物品。"},{header:"如何选择购买申请的商品？",slug:"如何选择购买申请的商品",content:"您可以通过查看商品的特征，从已创建的待售报价中以指定价格选择适合您的物品。或者，您可以指定要购买商品的价格，在这种情况下，将自动选择市场上价格最低的批次。如果没有价格合适的商品，您的请求将一直有效，直到它出现（72 小时）。然后，从您的帐户中扣除的购买商品的金额将退还到您的帐户。"}]},{path:"/SD.html",title:"商店",pathLocale:"/",contents:[{header:"商店",slug:"商店",content:""},{header:"我购买了高级商品，但没有收到购买的商品。",slug:"我购买了高级商品-但没有收到购买的商品。",content:""},{header:"购买可能会延迟记入贷方。如果您的购买在 12 小时后仍未激活，请联系支持人员并提供：",content:`您的游戏ID
您的购买收据
购买日期。`},{header:"我想退货购买的商品",slug:"我想退货购买的商品",content:"只有 3 天内购买的未使用的游戏内内容才会退款。在极少数情况下，30天内购买的商品将退款。所有退款申请均根据具体情况进行考虑，请注意，您可能会被拒绝退款。"},{header:"我选择的付款方式不可用，我该怎么办？出现错误窗口",slug:"我选择的付款方式不可用-我该怎么办-出现错误窗口",content:`如果错误文本包含超链接——单击它并尝试文章中描述的操作。
如果这没有帮助——请联系商店支持或现代战舰支持。`}]},{path:"/UP.html",title:"更新日志",pathLocale:"/",contents:[{header:"更新日志",slug:"更新日志",content:`提示
文章更上新等非重要更新，不会上传到更新日志 2023.6.27 目录修正 新增板块 内容修复 关联修复 新增彩蛋 2023.6.23 目录修正 新增板块 2023.6.18 网站修正 若干BUG修复 界面优化 2023.6.16 网站修正 若干BUG修复 首页修改 2023.6.12 网站修正 若干BUG修复 二维码生成器 2023.6.11 网站修正 若干BUG修复 2023.6.2 网站修正 若干BUG修复 新增主题自定义 添加PC板块 游戏下载 首页更新 2023.6.1 网站修正 若干BUG修复 新增声明 预添加PC板块 2023.5.30 网站修正 字体优化 若干BUG修复 2023.5.27 增加文章和目录 修正文章目录 2023.5.24 增加文章 修正文章目录 增加更新提示 2023.5.22 自己去看更新计划少了什么 2023.5.20 增加两个版面 增加评论功能 知识共享许可协议 2023.5.15 优化 增加彩蛋 2023.5.10 大更新 2023.5.4 更新模块 文件目录 更新日志 2023.5.1 网站上线`}]},{path:"/WF.html",title:"玩法",pathLocale:"/",contents:[{header:"玩法",slug:"玩法",content:""},{header:"我可以在没有互联网的情况下玩现代战舰吗？",slug:"我可以在没有互联网的情况下玩现代战舰吗",content:"不，所有游戏模式都需要稳定的互联网连接。"},{header:"如何与玩家交朋友？",slug:"如何与玩家交朋友",content:""},{header:"您可以通过以下几种方式将玩家添加为好友：",content:`在聊天室中，您应该单击名称，将弹出一个带有“添加到朋友”按钮的选项卡。
当您在主屏幕中时，单击屏幕左上角的昵称，然后单击“朋友”按钮，转到“添加朋友”选项卡并在搜索框中输入唯一的玩家ID。`},{header:"为什么我不能被添加为好友？",slug:"为什么我不能被添加为好友",content:"确保您没有在设置中关闭此功能，或者您已达到好友请求限制。"},{header:"如何禁止小队邀请？",slug:"如何禁止小队邀请",content:"转到“设置”，选项卡“游戏”，在列表末尾有一个名为“拒绝进入小队邀请”的切换。"},{header:"如何阻止好友请求？",slug:"如何阻止好友请求",content:"转到“设置”，选项卡“游戏”，列表末尾附近有一个名为“拒绝好友申请”的切换。"},{header:"什么是自定义游戏，如何创建？",slug:"什么是自定义游戏-如何创建",content:`自定义游戏是一种模式，任何玩家都可以创建自己的战斗，并在给定唯一的房间号的情况下邀请任何人加入游戏。最小玩家人数为 1 对 1，最大玩家人数为 5 对 5。房间创建者将玩家分配到团队。
要创建自己的游戏，请单击战斗按钮旁边的箭头按钮，单击“自定义游戏”，选择所需的地图，然后单击“创建”。`},{header:"如何加入其他玩家的房间？",slug:"如何加入其他玩家的房间",content:"玩家通常会在聊天室中发布他们的房间号。记住这个数字就足够了，退出聊天室，点击“战斗”按钮右侧的“箭头按钮”，转到“自定义游戏”，右侧会有一个输入框，您必须在其中输入发布的房间号。"},{header:"什么是黑名单，如何将玩家添加到黑名单中？",slug:"什么是黑名单-如何将玩家添加到黑名单中",content:`黑名单是您“锁定”您不想在聊天中看到其消息的玩家的一种方式。阻止玩家不会以任何方式影响玩家，但他们的消息不会显示在您的设备上。
在聊天室中，您应该单击要“阻止”的玩家，然后选择“添加到黑名单”功能。`},{header:"如何从黑名单中删除玩家？",slug:"如何从黑名单中删除玩家",content:"为了从黑名单中删除玩家，您应该转到“设置”，“帐户”选项卡并找到黑名单。单击它，您将打开所有“被阻止”玩家的列表。"},{header:"如何创建小队并邀请玩家？",slug:"如何创建小队并邀请玩家",content:""},{header:"有几种方法可以创小舰队：",content:`在主屏幕中，单击小队按钮，该按钮由一个图标显示，上面有 3 个人，旁边有一个 +，位于左上角玩家的昵称下方。您将被带到一个菜单，其中将显示您的中队窗口和所有朋友的列表。点击好友，邀请他们加入你的小队。
当您在聊天室中时，您可以单击玩家，然后在弹出的窗口中单击“邀请加入小队”。`},{header:"如何在我的小队中使用语音通信？",slug:"如何在我的小队中使用语音通信",content:"为了能够在小队中使用麦克风，有必要转到“设置”，转到“游戏”选项卡，然后打开切换开关“允许使用麦克风”。此操作必须由小队的所有成员执行。"},{header:"小队有哪些限制？",slug:"小队有哪些限制",content:"一支小队最少可以有 2 名球员，最多可以有 5 名球员。此外，一个小队最多只能组装一艘航空母舰或两艘相同类型的潜艇。"},{header:"有哪些游戏模式可用，如何选择游戏模式？",slug:"有哪些游戏模式可用-如何选择游戏模式",content:""},{header:"目前游戏中有 4 种游戏模式，所有游戏模式都需要稳定的互联网连接：",content:`离线与机器人
网络游戏与真人玩家（快速游戏）
小队战争 - 在线战斗，仅适用于小队
自定义游戏 - 在此模式下，您可以创建一个具有唯一编号的房间，并通过向其他玩家发送该号码来邀请他们。常用于测试设备和举办比赛。在此模式下，接收奖励是禁用的。
目前有两种模式可以在小队中玩 - 快速游戏和小队战争。
在快速游戏模式中，你的小队将参加全面的5v5战斗。如果你的小队少于5名玩家，你的盟友将是其他玩家或机器人。
在小队战争中，你的小队将遇到一个类似规模的敌方小队。在这种模式下，战斗可以在 2v2、3v3、4v4 和 5v5 中进行。`},{header:"根据你的小队成员的数量，你将能够以不同的模式进行游戏：",content:`2 人小队 - 快速游戏 + 小队战争
3 人小队 - 快速游戏 + 小队战争
4 人小队 - 仅限小队战争
5 人小队 - 仅限小队战争 小贴士
为了选择所需的游戏模式，您可以单击位于“快速战斗”右侧的“列表按钮”。`},{header:"网络游戏的级别是多少？",slug:"网络游戏的级别是多少",content:"真实玩家的在线模式从大约 5 级开始可用，当玩家获得进入战斗所需的技能水平时。"},{header:"如果我已经拥有一艘以每日奖励或战斗通行证赠送的飞船，我能得到什么？",slug:"如果我已经拥有一艘以每日奖励或战斗通行证赠送的飞船-我能得到什么",content:"玩家将获得游戏货币的补偿，相当于商店中船只的全部成本。"},{header:"为什么自定义游戏中没有奖励？",slug:"为什么自定义游戏中没有奖励",content:"游戏内奖励被关闭，以避免刷伤害，获得“额外”奖励。"},{header:"什么是“点赞”，我如何获得它们？",slug:"什么是-点赞-我如何获得它们",content:`“点赞”是作为“奖励”玩家战斗的系统引入的。
您只能在在线并参与随机战斗时使用“点赞”。
你不能“点赞”你小队的队员。
每场战斗只能获得一个“点赞”。
要给一个“点赞”，你必须等到战斗结束，无论是通过击杀还是按时间。
游戏中有一个点赞的排名，要查看它，请在主屏幕中单击您的昵称，转到“排名”、“有史以来赞最多的玩家”选项卡。`},{header:"我在“2级”，为什么我会遇到“3级”？",slug:"我在-2级-为什么我会遇到-3级",content:"如果您不在高等级中，但您的船装备了高等级的物品，您必须将其移除才能继续在您的等级上游玩。"}]},{path:"/YJ.html",title:"邮件",pathLocale:"/",contents:[{header:"邮件",slug:"邮件",content:""},{header:"为什么我需要游戏内邮件？",slug:"为什么我需要游戏内邮件",content:""},{header:"玩家可以在游戏内邮件中收到以下信件：",content:`随着游戏的新闻
与事件，锦标赛的结果
开发商赠送礼物
舰队活动
信息性（例如执行技术作品），欢迎信。`}]},{path:"/YS.html",title:"网站声明",pathLocale:"/",contents:[{header:"网站声明",slug:"网站声明",content:""},{header:"主要声明",slug:"主要声明",content:`提示
访问者在从事与本网站相关的所有行为(包括但不限于访问浏览、利用、转载、宣传介绍)时，必须以善意且谨慎的态度行事;访问者不得故意或者过失的损害或者弱化本网站的各类合法权利与利益，不得利用本网站以任何方式直接或者间接的从事违反中国法律、国际公约以及社会公德的行为，且访问者应当恪守下述承诺： 传输和利用信息符合中国法律、国际公约的规定、符合公序良俗;
不将本网站以及与之相关的网络服务用作非法用途以及非正当用途;
不干扰和扰乱本网站以及与之相关的网络服务;
遵守与本网站以及与之相关的网络服务的协议、规定、程序和惯例等。 本网站郑重提醒访问者：请在转载、上载或者下载有关作品时务必尊重该作品的版权、著作权;如果您发现有您未署名的作品，请立即和我们联系，我们会在第一时间加上您的署名或作相关处理。 除我们另有明确说明或者中国法律有强制性规定外，本网站用户原创的作品，本网站及作者共同享有版权，其他网站及传统媒体如需使用，须取得本网站的书面授权，未经授权严禁转载或用于其它商业用途。 本网站有权将在本网站内发表的作品用于其他用途，包括网站、电子杂志等，作品有附带版权声明者除外。 未经常本网站和原作者共同同意，其他任何机构不得以任何形式侵犯其作品著作权，包括但不限于：擅自复制、链接、非法使用或转载，或以任何方式建立作品镜像。 本网站所刊载的各类形式(包括但不仅限于文字、图片、图表)的作品仅供参考使用，并不代表本网站同意其说法或描述，仅为提供更多信息，也不构成任何投资建议。对于访问者根据本网站提供的信息所做出的一切行为，除非另有明确的书面承诺文件，否则本网站不承担任何形式的责任。 当本网站以链接形式推荐其他网站内容时，本网站并不对这些网站或资源的可用性负责，且不保证从这些网站获取的任何内容、产品、服务或其他材料的真实性、合法性，对于任何因使用或信赖从此类网站或资源上获取的内容、产品、服务或其他材料而造成(或声称造成)的任何直接或间接损失，本网站均不承担任何责任。 当政府部门、司法机关等依照法定程序要求本网站披露个人资料时，本网站将根据执法单位之要求或为公共安全之目的提供个人资料。在此情况下之任何披露，本网站均得免责。 本网站有部分内容来自互联网，如无意中侵犯了哪个媒体、公司、企业或个人等的知识产权，请来电或致函告之，本网站将在规定时间内给予删除等相关处理，若有涉及版权费等问题，请及时提供相关证明等材料并与我们联系，通过友好协商公平公正原则处理纠纷。 由于互联网服务的特殊性，MWdocs 有权基于合法理由，修改、变更、中断或终止部分或全部服务。MWdocs 保留采取前述变更行为而不需通知您的权利，由于变更行为而造成的任何损失，MWdocs 无需对您或对任何第三人承担任何责任。任何不可抗力因素导致的服务中断或终止，MWdocs 不负任何责任。`},{header:"关于 Cookies",slug:"关于-cookies",content:"MWdocs 所使用的 VuePress2 系统自动创建了数个 Cookies 以记录您的来访，但这些 Cookies 不会记录您的任何个人信息。"},{header:"一些题外话",slug:"一些题外话",content:`MWdocs 一直坚信，纯净安全的互联网环境需要我们共同维护。
因此，MWdocs 坚决反对某些公司擅自获取用户信息并以此盈利的无良行为。
MWdocs 以前没有，以后也不会以任何方式收集用户的隐私信息。`}]},{path:"/ZB.html",title:"装备",pathLocale:"/",contents:[{header:"装备",slug:"装备",content:""},{header:"如何在船上安装购买的装备？",slug:"如何在船上安装购买的装备",content:"购买装备（例如导弹）后，转到主屏幕并进入“战舰”选项卡（屏幕左下角），然后选择带有导弹的框，可用于安装在船上的装备（导弹）列表将出现在底部。该原理可用于安装任何设备。"},{header:"游戏中的旗帜和伪装有什么用？",slug:"游戏中的旗帜和伪装有什么用",content:"旗帜和伪装仅用于美观目的，不会给玩家带来任何战斗优势。"},{header:"什么时候会添加目前不在游戏中的国旗？",slug:"什么时候会添加目前不在游戏中的国旗",content:"我们已经在努力为所有旗帜添加到现代战舰上，但不幸的是，由于技术限制，我们无法立即完成。一旦我们解决了这个问题，我们将添加新的标志！"},{header:"“高级”（黄金）船和“美元”船有什么区别？",slug:"高级-黄金-船和-美元-船有什么区别",content:""},{header:"高级船只为收入提供加成：",content:`+20% 美元
+20% 黄金 小贴士
高级船可以在任何等级购买`},{header:"鱼雷",slug:"鱼雷",content:"适用于所有潜艇、船、直升机、飞机。可用于所有类型的船只。鱼雷有能力在船上停留，但船有时可以躲避鱼雷。例外是“RF Loon”，它不会被鱼雷击中。鱼雷的弹药有限。"},{header:"主炮",slug:"主炮",content:"游戏中的主炮范围从小口径到大口径不等。主炮是主要武器类型之一，弹药无限。当以锐角击中时，炮弹往往会从敌舰的船体上弹起。大炮安装在所有类型的军舰上，也安装在一些航空母舰上。无法安装在潜艇上。射击是通过弹道轨迹进行的，因此您需要根据敌舰的距离和运动来调整目标。轨道炮除外，它们以直线轨迹和高弹丸速度射击。敌人离得越远，对移动目标的偏差就越大。"},{header:"火箭炮",slug:"火箭炮",content:"火箭炮在大多数军舰和一些航空母舰上都有。它们在近距离和中距离都很有效。您会发现它们在远距离上不是很有效。火箭炮是唯一可以有效摧毁鱼雷的武器。弹药有限。"},{header:"导弹",slug:"导弹",content:"导弹是大多数舰艇上使用的主要武器。它们对敌人造成的伤害最大，但可以被敌人的防空系统以及“热诱弹”击落。导弹武器是有限的，并且因导弹类型而异。"},{header:"自卫炮",slug:"自卫炮",content:"玩家无法控制的一种武器。只要在射程内，自卫炮就会自动向最近的敌方单位射击（取决于自自卫炮的类型）。弹药是无限的。"},{header:"防空",slug:"防空",content:"防空是对抗敌方导弹和飞机的一种手段。防空系统有多种类型：机枪、导弹和激光类型。防空系统针对不同类型的目标（导弹、飞机和直升机）进行操作。当船只成群航行时，是防空的最大效果。当舰船机动时，防空的有效性会降低。"},{header:"直升机",slug:"直升机",content:"直升机可以保护您的船只免受导弹的伤害，攻击敌人，增加雷达范围，并可以使用声纳定位水下潜艇。一些直升机可以投下深水炸弹。高级版本的直升机还具有增强的生存能力和武器能力。可用于所有类型的船舶（潜艇除外），数量为 1。直升机配备了可以击落敌机的大炮，主要以手动模式瞄准。直升机上所有物品的弹药都是有限的。"},{header:"攻击机",slug:"攻击机",content:"攻击机，其主要目标是所有类型的舰艇。船上有可以击落敌机的大炮，主要瞄准手动模式。如果在射程内，可以很容易地被敌方防空系统击倒。攻击机仅在航空母舰上可用。该中队的武器装备有限。攻击机可以通过与来自其发射航空母舰的补给接触来重新装载和修理。"},{header:"战斗机",slug:"战斗机",content:"一种旨在与敌机作战的飞机。如果在射程内被击中，很容易被敌方防空系统击落。战斗机仅在航空母舰上可用。该中队的弹药有限。"},{header:"无人机",slug:"无人机",content:"无人机具有比攻击机更高的打击能力和生命水平。他们的主要目标是敌舰。他们还可以轻松对抗敌方空中部队。他们的装甲板弹药是有限的。无人机可以通过与航空母舰的补给接触来重新装载和修理。"},{header:"轰炸机",slug:"轰炸机",content:"轰炸机是游戏中最危险的飞机。它们的速度低，但生存能力强。它们基于“突击航母”。轰炸机拥有广泛的武器。所有类型的船只都是他们的主要目标。他们的武器有限，但可以通过与航母的补给接触来重新装填和修理。"}]},{path:"/ZD.html",title:"战斗",pathLocale:"/",contents:[{header:"战斗",slug:"战斗",content:""},{header:"如何在战斗中查看玩家表？",slug:"如何在战斗中查看玩家表",content:"可以通过单击顶部中心的计时器来查看战斗表。所有玩家，在两支队伍中，将显示他们的伤害总和和被击杀的对手数量。"},{header:"观战和射击模式。",slug:"观战和射击模式。",content:`玩家死亡时可以使用观战模式。如果您仍未分配到团队，则可以在自定义游戏中使用。您可以在玩家之间切换，或使用飞行相机。
您可以通过单击左上角的相机图标来选择捕获模式，所有不必要的界面叠加都将消失，您可以使用第三方屏幕录制应用程序为您的视频捕获干净的照片，或拍摄漂亮的快照。`},{header:"直升机有什么作用？",slug:"直升机有什么作用",content:""},{header:"直升机在战斗中具有一些基本功能：",content:`最基本的是点亮（发现）你的敌人。通过起飞直升机，你可以增加你的雷达范围，这样你就可以发现更远的敌人。您也可以驾驶直升机并将其飞向敌人，首先发现他们。这将在战斗中带来巨大的优势。
你可以把你的船留在后面，尝试使用直升机对敌人造成伤害。
直升机适合击落敌机。`},{header:"如何将直升机降落在船上？",slug:"如何将直升机降落在船上",content:"不可以将直升机降落回船甲板。"},{header:"如何将飞机中队降落在航空母舰的甲板上？",slug:"如何将飞机中队降落在航空母舰的甲板上",content:"没有着陆飞机的选择。"},{header:"我如何避免被发现？",slug:"我如何避免被发现",content:"为了逃离被发现，你必须移动到障碍物后面，不要在任何敌人的直接视线范围内。"},{header:"什么是战斗中的探测灯？",slug:"什么是战斗中的探测灯",content:"当您的飞船被敌人发现时，检测灯会闪烁，当您不再在视线范围内时，检测灯也会消失。"},{header:"使用潜艇时如何潜水和浮出水面？",slug:"使用潜艇时如何潜水和浮出水面",content:"在战斗中，按下潜水/浮出水面按钮一次，然后等待潜水或浮出水面。"},{header:"为什么强行浮出水面后我不能潜入水下？",slug:"为什么强行浮出水面后我不能潜入水下",content:"当您的氧气水平变得很低时，只有在完全补充空气后才能再次进入水下。"},{header:"如何摧毁鱼雷？",slug:"如何摧毁鱼雷",content:`鱼雷可以通过使用火箭炮来摧毁。
也可以尝试在水面舰艇上躲避鱼雷。机动的一个重要条件是你的速度必须足够高。在慢速船上，这种机动是行不通的。
在潜艇上，您可以在鱼雷击中潜艇之前浮出水面或潜水，以避免被鱼雷击中。`},{header:"如何定位潜水的潜艇？",slug:"如何定位潜水的潜艇",content:`探测敌方潜艇的最简单方法是使用另一艘潜艇。
潜艇也可以被直升机探测到。您必须近距离飞越潜艇，直升机的声纳才能探测到潜艇。`},{header:"为什么飞机可以飞离地图？",slug:"为什么飞机可以飞离地图",content:"这是有意为之，以便玩家可以操纵和转身。否则，您的飞机将在地图边缘被摧毁。"},{header:"战斗机和攻击机有什么区别？",slug:"战斗机和攻击机有什么区别",content:"攻击机用于战斗舰艇，而战斗机用于对抗敌机。"},{header:"如何更换直升机/飞机上的武器？",slug:"如何更换直升机-飞机上的武器",content:"你不能改变武器。飞机上的所有武器都是固定的。"},{header:"为什么我在船上需要防空系统？",slug:"为什么我在船上需要防空系统",content:"船上的防空系统用于对抗敌方导弹和飞机。防空系统也分为几类——有些擅长击退导弹袭击，而另一些则对飞机起作用。如果您的船允许，联合防空系统是最好的。"},{header:"如何在飞行中重新装载飞机？",slug:"如何在飞行中重新装载飞机",content:"飞机重新装填只能在航空母舰上空时进行。为此，请直接飞越甲板。飞越后，将触发补充计时器，一旦计时器到期，您可以再次为补给弹药或找回丢失的飞机。"}]},{path:"/ZG.html",title:"月初惯例，常见问题",pathLocale:"/",contents:[{header:"月初惯例，常见问题",slug:"月初惯例-常见问题",content:""},{header:"通行证赛季什么时候更新？",slug:"通行证赛季什么时候更新",content:"北京时间一号早八点"},{header:"为什么通行证倒计时卡成了几百小时？",slug:"为什么通行证倒计时卡成了几百小时",content:"需要更新最新版本"},{header:"上月BP物品几点上市场？",slug:"上月bp物品几点上市场",content:"我不道啊"}]},{path:"/ZH.html",title:"帐户",pathLocale:"/",contents:[{header:"帐户",slug:"帐户",content:""},{header:"如果我在游戏中丢失了存档。怎么办？",slug:"如果我在游戏中丢失了存档。怎么办",content:"您应该通过新手教程。然后转到游戏的“设置”选项卡——“帐户”选项卡——“退出登录”，重新启动游戏。选择最初与您的帐户绑定的登录方式。"},{header:"为什么我的游客帐户没有在线模式？",slug:"为什么我的游客帐户没有在线模式",content:"游客模式下的在线模式是故意关闭的，您需要授权您的帐户才能进入在线模式。"},{header:"如何举报作弊者？",slug:"如何举报作弊者",content:"您需要转到频道上的“游戏账号问题”类别——“【反馈】申请解封/举报”频道——发表“帖子”，然后将违规视频和违规者主页截图上传。重要条件：违规者的ID必须出现在您提供的帖子中，以便我们可以检查玩家。"},{header:"我在游戏中进行了“报价”，艺术币被扣除，但“报价”没有记入市场。我该怎么办？",slug:"我在游戏中进行了-报价-艺术币被扣除-但-报价-没有记入市场。我该怎么办",content:""},{header:"发生这种情况的原因有以下几个：",content:`与服务器的连接不稳定。您应该重新启动游戏。
谷歌/苹果服务尚未处理您的付款。有时这可能需要几个小时。 小贴士
如果您的问题仍然存在，请联系管理员。然后不要忘记提供您的个人ID和收据中的付款数据（Android的GPA代码），这些数据来自您的电子邮件。`},{header:"我无法进行“在线模式”。我必须做什么？",slug:"我无法进行-在线模式-。我必须做什么",content:`确保您的手机没有root模式（安卓开发者模式）。如果启用root模式，游戏将自动将您置于与机器人的匹配中。
您也可以转到“游戏账号问题”——“【反馈】申请解封/举报”频道——发表“帖子”并描述您的问题。不要忘记在那里写上您的ID，并附上截图。`},{header:"不断自动退出战斗。我该怎么办？",slug:"不断自动退出战斗。我该怎么办",content:""},{header:"有几个原因：",content:`您的互联网连接很弱。
您的互联网连接不稳定。
由于大量玩家在线，游戏服务器可能会过载 *正在服务器上进行技术维护工作。 小贴士
您应该改善您的互联网连接，如果问题仍然存在 - 请稍等片刻。`},{header:"我可以出售我的账户吗？",slug:"我可以出售我的账户吗",content:"根据使用条款，禁止转让或出售您的帐户。违反此规则将导致永久禁止。"},{header:"我的帐户丢失了。我该怎么办？",slug:"我的帐户丢失了。我该怎么办",content:"联系我们的管理员，不要忘记您的 ID 并描述您面临的问题。"},{header:"我可以将帐户上的授权方法从一种更改为另一种吗？",slug:"我可以将帐户上的授权方法从一种更改为另一种吗",content:"玩家将无法更改帐户授权。如果切换授权方法，则还会切换不同的帐户。只有游戏开发人员才能在特殊情况下提供帮助。如果您处于特殊情况，请寻找管理员寻求帮助。"},{header:"注册确认信不会邮寄。",slug:"注册确认信不会邮寄。",content:"检查您的垃圾邮件文件夹，如果未找到电子邮件，请重试。"},{header:"如何重置密码？",slug:"如何重置密码",content:"禁用游戏设置中的“退出登录”选项，然后选择邮件授权，登录窗口将为您提供重置密码的选项。"},{header:"我在哪里可以找到我的游戏账号ID？",slug:"我在哪里可以找到我的游戏账号id",content:`在主菜单中单击您的姓名，您将被带到带有统计数据的选项卡，您可以在其中复制您的ID。
在您的游戏ID的右侧有一个“复制”按钮，可让您快速共享您的ID。`},{header:"如何更改我的头像？",slug:"如何更改我的头像",content:"该游戏能够从GooglePlay放置自定义头像，为此您需要将其放在GooglePlay帐户中，它将自动转移。"},{header:"游戏内如何获得彩色昵称？",slug:"游戏内如何获得彩色昵称",content:"彩色昵称仅适用于管理员和开发者。"},{header:"我的帐户被黑客入侵，资源被撤回。我该怎么办？",slug:"我的帐户被黑客入侵-资源被撤回。我该怎么办",content:`声明
ARTSTORM 不对您的帐户丢失负责。您帐户的安全性掌握在您手中。禁止将游戏帐户或数据转让给第三方。在这种情况下，我们建议您恢复对与您的帐户关联的所有授权方法的访问权限，更改密码并写入支持人员。在极少数情况下，如果您能验证该帐户是否属于您，我们可能会提供帮助。`},{header:"我的帐户被冻结了。我该怎么办？",slug:"我的帐户被冻结了。我该怎么办",content:""},{header:"在这些情况下，我们无法为您提供帮助。",content:`账户转账
使用作弊，脚本，任何第三方程序
购买/出售帐户，升级帐户以获取金钱（争夺）
侮辱游戏管理。`}]},{path:"/ZY.html",title:"资源",pathLocale:"/",contents:[{header:"资源",slug:"资源",content:""},{header:"为什么我需要白金？",slug:"为什么我需要白金",content:`购买“传奇战舰”需要白金，具有“传奇”状态的玩家可以使用这些战舰。（有关“传奇”状态的更多信息，请参阅锦标赛）
白金可以通过赢得社区锦标赛并成为传奇获得。`},{header:"我需要黄金做什么？",slug:"我需要黄金做什么",content:`购买“高级舰船”和“高级装备”需要此资源。您还可以购买旗帜、迷彩和 24 小时使用的高级帐号。也可以使用金币跳过战斗通行证，并重置每日任务。
在比赛中杀死敌舰可获得黄金。杀死 1 名玩家可获得一根黄金。您还可以通过观看广告、每日奖励、完成战斗通行证和提高玩家的角色等级来获得黄金。`},{header:"美元是干什么用的？",slug:"美元是干什么用的",content:`美元是最基本的游戏资源。该货币用于购买船只、装备、“升级芯片”和“消耗品”。
美元可在离线和在线战斗以及一些日常奖励中获得。`},{header:"艺术币有什么用？",slug:"艺术币有什么用",content:`Artcoin是一种独特的货币，可以通过查看广告（每次观看1个Artcoin）和出售战斗通行证中的物品来获得。您也可以在游戏商店中购买Artcoins，就像其他资源一样。
在自由市场上购买物品需要艺术币 - 独特的船只和设备。`},{header:"什么是“消耗品”，如何购买？",slug:"什么是-消耗品-如何购买",content:`目前游戏中有4种消耗品：“管损小队”、“热诱弹”、“弹药储备”和“飞机热诱弹”。使用它们会增加您在激烈战斗中生存的机会。
需要“管损小队”来修理战斗中的船只。
如果敌方导弹接近，应使用“热诱弹”，以破坏制导并避免伤害。
如果您在战斗中弹药用完，则使用“弹药储备”。
“飞机热诱弹”仅在控制飞机破坏敌方导弹制导时使用。
要购买消耗品，您必须去商店。为此，您需要单击屏幕右上角的美元或黄金，然后转到消耗品部分。`},{header:"我购买了消耗品，但它们没有出现在我的游戏帐户中。",slug:"我购买了消耗品-但它们没有出现在我的游戏帐户中。",content:"这是一个视觉错误。请重新登录游戏，您购买的消耗品将出现在您的帐户中。"},{header:"是否可以将一种资源交换为另一种资源，是否可以在玩家之间转移资源？",slug:"是否可以将一种资源交换为另一种资源-是否可以在玩家之间转移资源",content:"不，游戏中没有资源交换器，也没有办法在玩家之间转移资源。不打算添加此类功能。"},{header:"如何购买设备？",slug:"如何购买设备",content:`要购买设备，请单击屏幕右下方的“装备商店”，选择感兴趣的项目并进行购买。
要出售设备，请单击设备商店左侧的库存选项卡。`},{header:"如何出售船舶？",slug:"如何出售船舶",content:`无法从商店出售船。您有机会在购买之前试驾这艘船。为此，请单击“购买”按钮右侧的钥匙图像。
您可以使用自由市场功能从战斗通行证中买卖战舰（请参阅市场部分）。`},{header:"什么是“高级账户”，如何获得？",slug:"什么是-高级账户-如何获得",content:""},{header:"“高级帐户” 让您有机会获得额外的游戏内资源，即",content:`+10% 经验加成
+50% 美元
+50% 黄金`},{header:"您可以购买三个期限的高级帐户访问权限：",content:`24小时可以黄金购买
每周和每月保费可以真实货币购买 小贴士
如果您没有高级帐户，只需去商店购买即可购买。为此，请单击屏幕右上角的美元或黄金，然后单击“高级帐户”选项卡。`},{header:"什么是“升级芯片”，在哪里购买？",slug:"什么是-升级芯片-在哪里购买",content:`“升级芯片”是玩家可以升级船和装备的点数。完全升级的装备或船比基本值提高了 30%。
要购买升级积分，请单击主屏幕上的金币或美元，您将被带到商店，您应该在其中单击“升级芯片”选项卡。
缺少升级芯片。这是一个视觉错误。请重新登录游戏，您购买的升级芯片将显示在您的帐户中。`},{header:"使用升级芯片的最佳方式是什么？",slug:"使用升级芯片的最佳方式是什么",content:""},{header:"为了改进您的船或装备，您可以前往改装厂。当您在主屏幕上时，您会在屏幕左下角找到此选项卡。有两种类型的升级：",content:`1 升级点。
10 升级点。`},{header:"升级安排如下:",content:"10 个“升级点”中的前 3 个以 100% 的成功几率升级。然后几率下降到 60%，并随着每个连续的单元格而下降，直到最后一个单元格的成功几率达到 5%。每个升级条平均需要 40-60 点。"}]},{path:"/404.html",title:"",pathLocale:"/",contents:[]}],E="update-vuepress-plugin-full-text-search2-search-index";var L=v(_),R=D(()=>{const e=new Map;for(const n of L.value)e.set(n.path,n);return e});import.meta.webpackHot&&(__VUE_HMR_RUNTIME__[E]=e=>{L.value=e});function $(e){const n=v([]);let l=null;return B(e,()=>{l&&clearTimeout(l),l=setTimeout(a,100)}),n;function a(){const h=e.value.toLowerCase().trim();if(!h){n.value=[];return}const s=new Map,t=new Set;for(const o of L.value)for(const r of K(o,h)){t.add(r.parentPageTitle);let c=s.get(r.parentPageTitle);c||(c=[],s.set(r.parentPageTitle,c)),c.push(r)}const d=[...t].sort((o,r)=>{const c=s.get(o);return s.get(r).length-c.length});n.value=[...s].flatMap(([,o])=>o).sort((o,r)=>o.parentPagePriority-r.parentPagePriority||d.indexOf(o.parentPageTitle)-d.indexOf(r.parentPageTitle)||o.priority-r.priority)}}function*K(e,n){const l=C(e.title,n);if(l){yield{path:e.path,parentPageTitle:w(e),title:e.title,display:l,page:e,content:null,parentPagePriority:1,priority:1};return}for(const a of e.contents){const h=C(a.header,n);if(h){yield{path:e.path+(a.slug?`#${a.slug}`:""),parentPageTitle:w(e),title:e.title,display:h,page:e,content:null,parentPagePriority:10,priority:2};continue}const s=C(a.content,n);s&&(yield{path:e.path+(a.slug?`#${a.slug}`:""),parentPageTitle:w(e),title:e.title,display:[{type:"header",str:`${a.header}
`},...s],page:e,content:null,parentPagePriority:10,priority:10})}}function w(e){const n=e.path.split("/");let l="/";return n[1]&&(l=`/${n[1]}/`),(R.value.get(l)||e).title}function C(e,n){const l=[];let a=0;const h=e.toLowerCase().replace(/\s/gu," ");let s=0,t=h.indexOf(n,s);if(t<0)return null;for(;t>=0;){const o=t+n.length;if(d(e.slice(s,t),"normal"),d(e.slice(t,o),"highlight"),s=o,t=h.indexOf(n,s),a>100)break}return d(e.slice(s),"normal"),l.filter(o=>o.str);function d(o,r){let c=o;r==="normal"&&c.length>100&&a===0&&(c=`… ${c.slice(-10)}`);let p=!1;if(a+c.length>100){if(l.some(f=>f.type==="ellipsis"))return;c=c.slice(0,Math.max(100-a,1)),p=!0}l.push({type:r,str:c}),a+=c.length,p&&(l.push({type:"ellipsis",str:" …"}),a+=2)}}const x={"/":{placeholder:"搜索"}},Y=G({name:"SearchBox",props:{locales:{type:Object,required:!1,default:()=>x}},setup(e){const{locales:n}=b(e),l=v(""),a=v(!1),h=v(-1),s=$(l),t=D(()=>l.value&&a.value&&s.value.length),d=O(),o=U(),r=D(()=>n.value[o.value]??{});function c(){if(!t.value)return;let u=h.value-1;u<0&&(u=s.value.length-1),f(u)}function p(){if(!t.value)return;let u=h.value+1;u>=s.value.length&&(u=0),f(u)}function f(u){h.value=u}function S(){h.value=-1}function T(u){if(!t.value)return;const I=s.value[u];I&&d.push(I.path)}return{query:l,focused:a,focusIndex:h,suggestions:s,activeSuggestion:t,onUp:c,onDown:p,focus:f,unfocus:S,go:T,locale:r}}});const H={class:"search-box",role:"search"},z=["placeholder"],Z=["onMousedown","onMouseenter"],j=["href"],J={key:0,class:"parent-page-title"},q={class:"suggestion-row"},Q={class:"page-title"},ee={class:"suggestion-content"};function ne(e,n,l,a,h,s){return g(),i("div",H,[V(m("input",{ref:"input","onUpdate:modelValue":n[0]||(n[0]=t=>e.query=t),"aria-label":"Search",class:P({focused:e.focused}),placeholder:e.locale.placeholder??"Search",autocomplete:"off",spellcheck:"false",onFocus:n[1]||(n[1]=()=>e.focused=!0),onBlur:n[2]||(n[2]=()=>e.focused=!1),onKeyup:[n[3]||(n[3]=A(t=>e.go(e.focusIndex),["enter"])),n[4]||(n[4]=A((...t)=>e.onUp&&e.onUp(...t),["up"])),n[5]||(n[5]=A((...t)=>e.onDown&&e.onDown(...t),["down"]))]},null,42,z),[[F,e.query]]),e.activeSuggestion?(g(),i("ul",{key:0,class:"suggestions",onMouseleave:n[7]||(n[7]=(...t)=>e.unfocus&&e.unfocus(...t))},[(g(!0),i(y,null,k(e.suggestions,(t,d)=>(g(),i("li",{key:d,class:P(["suggestion",{focused:d===e.focusIndex}]),onMousedown:o=>e.go(d),onMouseenter:o=>e.focus(d)},[m("a",{href:t.path,onClick:n[6]||(n[6]=X(()=>{},["prevent"]))},[t.parentPageTitle&&(!e.suggestions[d-1]||e.suggestions[d-1].parentPageTitle!==t.parentPageTitle)?(g(),i("div",J,M(t.parentPageTitle),1)):W("v-if",!0),m("div",q,[m("div",Q,M(t.title||t.path),1),m("div",ee,[(g(!0),i(y,null,k(t.display,(o,r)=>(g(),i("span",{key:r,class:P(o.type)},M(o.str),3))),128))])])],8,j)],42,Z))),128))],32)):W("v-if",!0)])}const ae=N(Y,[["render",ne],["__scopeId","data-v-fd6cd4d5"],["__file","SearchBox.vue"]]);export{ae as default};
